## Plan for log_archive/sre_bot
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `aws_iam_policy.security_oscal_report`                                       |
|        | `aws_iam_role_policy_attachment.security_oscal_report`                       |
|        | `module.OIDC_Roles.aws_iam_role.this[&quot;security_oscal_report_github_action&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.security_oscal_report will be created
  + resource "aws_iam_policy" "security_oscal_report" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "security_oscal_report"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "config:GetComplianceSummaryByResourceType"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadConfig"
                    },
                  + {
                      + Action   = "securityhub:GetFindings"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadSecurityHub"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.security_oscal_report will be created
  + resource "aws_iam_role_policy_attachment" "security_oscal_report" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "security_oscal_report_github_action"
    }

  # module.OIDC_Roles.aws_iam_role.this["security_oscal_report_github_action"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/oscal-compliance:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::274536870005:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "security_oscal_report_github_action"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.assume_sre_vulnerability_report"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
